'''Проверка Python — этап 1
Всего будет 5 практических задач. Идём строго по одной, чтобы я мог оценивать твои знания по ходу дела.
Задача 1 из 5 — циклы, условия и списки
Дан список:
numbers = [4, -3, 8, 0, 11, -6, 15, 2, -9, 10]



Напиши программу, которая:
1. Создаёт новый список только из положительных чётных чисел.
2. Считает сумму этих чисел.
3. Выводит оба результата.
Ожидаемый вывод:
[4, 8, 2, 10]'''


numbers = [4, -3, 8, 0, 11, -6, 15, 2, -9, 10]
numbers_plus = []
summa = 0
for number in numbers:
    if number > 0 and number % 2 == 0:
        numbers_plus.append(number)
        summa = summa + numbers_plus[-1] # подсказал  pycharm

print(numbers_plus)
print(numbers_plus, summa)